In [41]:
import pandas as pd

In [42]:
boys = pd.read_csv("C:/Users/rvaish/Documents/Python Scripts/MachineLearningPython-DataWrangling/MachineLearningPython-DataWrangling/Data/schools_with_btoilet.csv")

In [43]:
girls = pd.read_csv("C:/Users/rvaish/Documents/Python Scripts/MachineLearningPython-DataWrangling/MachineLearningPython-DataWrangling/Data/schools_with_gtoilet.csv")

In [44]:
print(boys.shape)
print(girls.shape)

(110, 13)
(110, 13)

# [1] CONCAT

### AXIS

In [45]:
result = pd.concat([boys,girls], axis=0)
print(result.shape)

(220, 13)

In [46]:
result.head(3)

,State_UT,year,Primary_Only,Primary_with_U_Primary,Primary_with_U_Primary_Sec_HrSec,U_Primary_Only,U_Primary_With_Sec_HrSec,Primary_with_U_Primary_Sec,U_Primary_With_Sec,Sec_Only,Sec_with_HrSec.,HrSec_Only,All Schools
0,Andaman & Nicobar Islands,2013-14,91.58,97.37,100.0,0.0,100.0,100.0,0.0,0.0,100.0,0.0,94.52
1,Andaman & Nicobar Islands,2014-15,100.00,100.00,100.0,100.0,100.0,100.0,0.0,0.0,100.0,0.0,100.00
2,Andaman & Nicobar Islands,2015-16,100.00,100.00,100.0,0.0,100.0,100.0,0.0,0.0,100.0,0.0,100.00

In [47]:
result = pd.concat([boys,girls], axis=1)
print(result.shape)

(110, 26)

In [48]:
result.head(3)

,State_UT,year,Primary_Only,Primary_with_U_Primary,Primary_with_U_Primary_Sec_HrSec,U_Primary_Only,U_Primary_With_Sec_HrSec,Primary_with_U_Primary_Sec,U_Primary_With_Sec,Sec_Only,...,Primary_with_U_Primary,Primary_with_U_Primary_Sec_HrSec,U_Primary_Only,U_Primary_With_Sec_HrSec,Primary_with_U_Primary_Sec,U_Primary_With_Sec,Sec_Only,Sec_with_HrSec.,HrSec_Only,All Schools
0,Andaman & Nicobar Islands,2013-14,91.58,97.37,100.0,0.0,100.0,100.0,0.0,0.0,...,95.98,98.81,91.39,98.25,97.33,94.40,99.06,98.36,76.14,91.23
1,Andaman & Nicobar Islands,2014-15,100.00,100.00,100.0,100.0,100.0,100.0,0.0,0.0,...,96.92,99.48,91.39,99.23,98.19,96.61,90.26,94.05,90.94,93.08
2,Andaman & Nicobar Islands,2015-16,100.00,100.00,100.0,0.0,100.0,100.0,0.0,0.0,...,99.03,99.72,96.32,99.60,99.31,98.82,95.18,98.31,96.22,97.52

### IGNORE INDEX

In [49]:
result = pd.concat([boys,girls], axis=0, ignore_index=False)
print(result.shape)
result=result.iloc[108:114,0:2]
print(result)

(220, 13)
                      State_UT     year
108                  All India  2014-15
109                  All India  2015-16
0                    All India  2013-14
1                    All India  2014-15
2                    All India  2015-16
3    Andaman & Nicobar Islands  2013-14

In [61]:
result = pd.concat([boys,girls], axis=0,ignore_index=True)
print(result.shape)
result=result.iloc[108:114,0:2]
print(result)

(220, 13)
                      State_UT     year
108                  All India  2014-15
109                  All India  2015-16
110                  All India  2013-14
111                  All India  2014-15
112                  All India  2015-16
113  Andaman & Nicobar Islands  2013-14

In [62]:
#------------------------------------------------EXAMPLE#2-------------------------------------------------------------

In [77]:
df11 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                       'B': ['B0', 'B1', 'B2', 'B3'],
                       'C': ['C0', 'C1', 'C2', 'C3'],
                       'D': ['D0', 'D1', 'D2', 'D3']},
                       index=[0, 1, 2, 3])


df22 = pd.DataFrame({
                     'F': ['B4', 'B5', 'B6', 'B7'],
                     'E': ['C4', 'C5', 'C6', 'C7']},
                      index=[4, 5, 6, 7])

In [78]:
result = pd.concat([df1,df2], axis=0,ignore_index=True, sort=True)
print(result)​ignore_index=True

     A    B    C    D    E    F
0   A0   B0   C0   D0  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN
2   A2   B2   C2   D2  NaN  NaN
3   A3   B3   C3   D3  NaN  NaN
4  NaN  NaN  NaN  NaN   C4   B4
5  NaN  NaN  NaN  NaN   C5   B5
6  NaN  NaN  NaN  NaN   C6   B6
7  NaN  NaN  NaN  NaN   C7   B7

In [79]:
result = pd.concat([df1,df2], axis=1,ignore_index=True, sort=True)
print(result)

     0    1    2    3    4    5
0   A0   B0   C0   D0  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN
2   A2   B2   C2   D2  NaN  NaN
3   A3   B3   C3   D3  NaN  NaN
4  NaN  NaN  NaN  NaN   B4   C4
5  NaN  NaN  NaN  NaN   B5   C5
6  NaN  NaN  NaN  NaN   B6   C6
7  NaN  NaN  NaN  NaN   B7   C7

# [2] APPEND

In [80]:
boysgirls = boys.append(girls)

In [81]:
print(boysgirls.shape)

(220, 13)

In [82]:
boysgirls=boysgirls.iloc[108:114,0:2]
print(boysgirls)

                      State_UT     year
108                  All India  2014-15
109                  All India  2015-16
0                    All India  2013-14
1                    All India  2014-15
2                    All India  2015-16
3    Andaman & Nicobar Islands  2013-14

In [84]:
#We can append multi dataframes
result = boys.append([girls])


result=result.iloc[108:114,0:2]
print(result)

                      State_UT     year
108                  All India  2014-15
109                  All India  2015-16
0                    All India  2013-14
1                    All India  2014-15
2                    All India  2015-16
3    Andaman & Nicobar Islands  2013-14

In [88]:
result = df11.append(df22, ignore_index=True, sort=False)
print(result)

     A    B    C    D    F    E
0   A0   B0   C0   D0  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN
2   A2   B2   C2   D2  NaN  NaN
3   A3   B3   C3   D3  NaN  NaN
4  NaN  NaN  NaN  NaN   B4   C4
5  NaN  NaN  NaN  NaN   B5   C5
6  NaN  NaN  NaN  NaN   B6   C6
7  NaN  NaN  NaN  NaN   B7   C7

# [3] JOIN

In [55]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                       'B': ['B0', 'B1', 'B2', 'B3'],
                       'C': ['C0', 'C1', 'C2', 'C3'],
                       'D': ['D0', 'D1', 'D2', 'D3']},
                       index=[0, 1, 2, 3])


df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                     'B': ['B4', 'B5', 'B6', 'B7'],
                     'C': ['C4', 'C5', 'C6', 'C7'],
                     'D': ['D4', 'D5', 'D6', 'D7']},
                      index=[4, 5, 6, 7])
                   
                   
                   
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                     'B': ['B8', 'B9', 'B10', 'B11'],
                     'C': ['C8', 'C9', 'C10', 'C11'],
                     'D': ['D8', 'D9', 'D10', 'D11']},
                     index=[8, 9, 10, 11])

In [56]:
df1.head()

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3